<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2019/8/13
 * Time: 15:49
 */
//$str = "<p><p style=\"text-align: center;\"><img src=\"http://cdn.007dir.cn/wp-content/uploads/11e4deae6de5d1ba9f4c2fb7322f824fjpg\" /></p></p><p>合作详情</p><p>胡格格撸串火锅，是一家定位简约、年轻的时尚餐饮品牌，以轻奢、小资、快时尚为主打风格，规矩里透着张扬，张扬里含着内敛，打破规矩，别具一格，就象食客的后花园可聚会狂欢，浪漫约会，个人独自，无聊闲坐。作为一个多产品线复合型餐饮品牌，在广泛考察论证中，这种模式广泛适用于商场、社区、街边等类型门店，同时也适用于各级城市。</p><p>公司在基于品牌独有的运营模式和产品优势，依托于已有成熟的招商连锁模式，致力于全国门店的连锁拓展，以单店运营模式研究探索和全国连锁门店拓展相结合，快速的拓展全国餐饮市场。</p><p>在结合传统餐饮的同时充分考虑年轻消费群体的休闲、聚会需求。烤串、小吃、卤菜、冷串的植入摆脱休闲咖啡等纯饮品类型餐饮的单一场景，胡格格撸串·火锅，全新组合的餐饮模式，定位简约、年轻，门店依托于复合型餐饮单店运营模式，并结合多渠道的新媒体营销思路，打造一个利于商圈人气，多场景适应的餐饮门店。</p><p>品牌25年餐饮运营经验，100万+资金投入，全渠道网红门店打造，助力门店生根发展，门店打造。基于品牌独有的运营模式和产品优势，依托于全国600+连锁门店的招商连锁模式，致力于全国门店的连锁拓展，以单店运营模式研究探索和全国连锁门店拓展相结合，快速实现品牌扩张和年产值1000万+目标。</p><p><img src=\"http://cdn.007dir.cn/wp-content/uploads/1565575979.08521169101779.jpg\" /></p><p>合作优势</p><p>1、产品+在菜单上做减法，客单上做加法、科学定价，提高门店营收，增加毛利率。</p><p>2、时间+利用10:00-11:00、13:00-17:00、22:30-02:00非正餐营业时间，提升门店营收。</p><p>3、赢销+各平台精准营销投放，提升门店客流，会员系统，精准锁客，增加复购率，提升门店营收。</p><p>4、管理+ 采购库存员工排班，能耗精细化管理节减门店开支，降低运营成本，提升利润率。</p><p><img src=\"http://cdn.007dir.cn/wp-content/uploads/1565575981.6061898202180.jpg\" /></p><p>合作条件</p><p>1、特许合作：</p><p>由投资者与总部签订特许合作合同，享有指定品牌的商标使用权及经营管理指导支持，并向总部一次性支付相关费用(包含合作费、运营管理费、保证金、设计费等)，由公司总部统一设计制定店面SI环境；特许合作店的门店使用面积不低于200平米。</p><p>2、区域代理：</p><p>由投资者全额投资缴纳区域代理费用，由代理商代表总部在合同约定行政区域内按总部要求发展连锁门店，独立享有行政区域内的连锁利润；代理商至少在该区域内有1家直营店，且每年必须发展连锁门店5家以上。</p><p>3、技术合作：</p><p>由投资者与总部签订技术合作协议，享有公司总部的技术使用权及经营管理指导支持，并向总部一次性支付相关费用(包含技术合作费、运营管理费等)。</p><p>合作支持</p><p>1. 新品开发技术指导：提供新品的开发和技术指导。</p><p>2. 营运督导服务：后续营运督导到店服务。</p><p>3. 品牌营销推广方案：免费全年营销方案及品牌推广指导。</p><p>4. 专业筹备营建团队：从事餐饮行业筹备，营建5-8年以上工作经验。</p><p>5. 稳定的物资配送：拥有自己的生产厂，配送更方便快捷。</p><p>6. 连锁运营12大系统：业务计划、内部沟通、盘存系统、训练系统、人事实物、生产、食品安全、服务、安全保全、排版系统、值班系统、计划保养。</p><p>7. 经验模式标准化复制：投资成本低，市场更容易推广流行。</p><p>8. 标准化技术指导：人为因素影响小，口味更容易达成一致。</p><p><img src=\"http://cdn.007dir.cn/wp-content/uploads/1565575982.08531384223087.jpg\" /></p>";
//$filed = "<p>合作";
////$str = str_replace(PHP_EOL,'',$str);
//$pos = strpos($str,$filed,0);
//var_dump($pos);
//$fenciTitle = "面___ 面时__ 时光__";
//$titArr = mb_split("\W+", trim($fenciTitle));
//var_dump($titArr);


/**
 * 项目中使用
 * 匹配img和src,如果匹配成功  $m[0] img的值，  $m[1] src的值
 */
function pipei_img(){
    $pattern = "/<img.*?src=\"(.*?)\".*?\/?>/i";
    $content = '<p style="text-align: center;"><img /></p>合作详情解放碑老火锅的前身为王氏杂锅，起源于清明时期，位于嘉陵江北岸的刘家台大码头';
    if(preg_match($pattern,$content,$m)) {
        $haibao_img = $m[0];
    }
    var_dump($m);
}
//pipei_img();



function pipei_img2(){
    $str  ='eeeeeee<img src="aaa.jpg" />asad<img src="bbb.jpg" />';
    preg_match('/<img src="(.*?)" \//',$str,$result);
    print_r($result);
}
//pipei_img2();

function pipei_img3(){
    $str = 'eeeeeee<img src="aaa.jpg" />asad<img src="bbb.jpg" />';
    preg_match_all('/<img.*?src="(.*?)".*?>/is',$str,$array);
    print_r($array);
}
//pipei_img3();

$content = "撒大大大啊啊啊<img src='aaaa.jpg' />打个电话";
$content = preg_replace('/<img /i','<img style="max-width:100%;height:auto;display:block" ',$content);
var_dump($content);

