<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2019/11/8
 * Time: 16:26
 */
$category = '餐饮,火锅,烧烤,炸鸡,鱼火锅,蟹煲,奶茶饮品,牛排杯,冒菜,果汁果饮,快餐,中餐,烤鱼,小吃,酸菜鱼,西餐,美蛙鱼头,蛋糕,甜品,酸奶,饺子,串串香,麻辣烫,卤味熟食,汉堡,外卖便当,冰淇凌,猪蹄,牛肉汤,贡茶,米粉米线,咖啡,面馆,黄焖鸡米饭,豆浆,韩国料理,铁板烧,花甲,小龙虾,砂锅,煲仔饭,包子,寿司,臭豆腐,麻辣香锅,焖锅,日本料理,酸辣粉,饭团,馄饨,凉皮,披萨,肉夹馍,生煎,豆腐脑,煎饼,牛杂,馅饼,粥,羊肉汤,面包,卤肉卷,螺蛳粉,烤鹅烤鸭,干锅,胡辣汤,烧饼,石锅鱼,旋转火锅,锅贴,啵啵鱼,牛肉火锅,泰国菜,炒饭,重庆小面,米粉,米线,烤肉,牛排,冷锅串串,海鲜,荷叶饭,羊肉火锅,茶餐厅,湘菜馆,地锅鸡,拌饭,自助餐,餐饮培训,跷脚牛肉,卤肉饭,锅盔,酒馆,鸡公煲,海鲜火锅,市井火锅,母婴,婴儿游泳,儿童乐园,母婴用品,月子中心,儿童玩具,儿童摄影,儿童手工,小儿推拿,产后恢复,零售,便利店,白酒,零食店,渔具,啤酒,茶叶,零售百货,超市,成人用品,红酒,药店,水果店,文具店,书店,眼镜,牛奶,佛教用品,无人售货,炒货,办公用品,生鲜,电子烟,服装,女装,内衣,鞋,品牌服装,男士专属,精品童装,箱包,休闲,户外,皮草,婚纱礼服,服装定制,教育,早教,幼儿园,教育培训,英语培训,潜能培训,IT培训,出国留学,学习辅导,作文培训,机器人教育,舞蹈培训,艺术教育,少儿编程,绘本馆,书法,国学馆,美术教育,数学培训,冬夏令营,在线教育,心理教育,建材,油漆涂料,地板,门窗栏杆,家居日用,灯饰,墙纸,家具,硅藻泥,服务,干洗,家政,汽车服务,摄影,家电清洗,宠物店,新奇特,房产中介,民宿,充电站,婚庆服务,游乐,VR体验馆,游乐,酒吧,KTV,网咖,影院,游戏,密室逃脱,珠宝礼品,饰品,礼品,首饰,珠宝,翡翠玉石,美容保健,汗蒸,美甲纹绣,养生,美容,化妆品,减肥瘦身,护肤品,健身房,视力保健,足浴足疗,美发,养发,皮肤管理,理疗,艾灸,推拿按摩,口腔牙科,整形美容,假发,家居,建材厨卫,装饰装修,家具饰品,窗帘,家居用品,集成墙饰,卫浴,家纺,电暖画,智能家居,智能锁,橱柜,集成灶,环保,空气净化,家电,汽车用品,电动车,数码用品,车衣,室内环保,平衡车,太阳能,新能源汽车,净水器,酒店,快捷酒店,商务酒店,民宿,旅馆,主题酒店,精品酒店,冰淇淋,';
$post_content = "太郎花子婚纱摄影成立于2001年，定位于中国高端婚纱摄影，是一家以人性化服务及摄影品质著称的知名品牌影楼。旗舰店地处市中心景德路繁华地段，国际店地处苏州主干道干将路，以及拥有目前华东地区最大的外景拍摄基地，耗资千万，特聘韩国顶尖原班造景师团队，全权规划设计，独门独户，将城市的喧嚣至于门外，总营业面积达2万平方米。凭借先进的硬软件设施，客户满意服务系统，国际风尚的新摄影风格，世界高端品牌礼服专区;全立体内景实景棚，七大场馆六大外景，成为婚纱摄影行业高端品牌！浪漫之旅就在太郎花子！";

$post_data = array(
    "post_content" => $post_content,
    'categories' => $category
);

$ch_m = curl_init();
$options_m =  array(
    CURLOPT_URL => 'http://47.103.116.147:8083/api/v1.0/nlp/cdd_web',
    CURLOPT_POST => true,
    CURLOPT_RETURNTRANSFER => true,
    CURLOPT_TIMEOUT => 3,
    CURLOPT_POSTFIELDS => json_encode($post_data),
    CURLOPT_HTTPHEADER => ['content-type'=> 'application/json', 'charset'=>'utf-8']
);
curl_setopt_array($ch_m, $options_m);
$result_m = curl_exec($ch_m);
$result_obj_m = json_decode($result_m);
var_dump($result_obj_m->data->keywords);